---
kind: method
id: M:Autodesk.Revit.DB.LinkElementId.op_Inequality(Autodesk.Revit.DB.LinkElementId,Autodesk.Revit.DB.LinkElementId)
source: html/0606d514-9ef9-2631-3698-7d380c06eee5.htm
---
# Autodesk.Revit.DB.LinkElementId.op_Inequality Method

Determines whether these two LinkElementIds are different.

## Syntax (C#)
```csharp
public static bool operator !=(
	LinkElementId first,
	LinkElementId second
)
```

## Parameters
- **first** (`Autodesk.Revit.DB.LinkElementId`) - The first LinkElementId.
- **second** (`Autodesk.Revit.DB.LinkElementId`) - The second LinkElementId.

## Returns
True if the LinkElementIds are different; otherwise, false.